package eu.tutorials.landmarksapp

import androidx.compose.foundation.Image
import androidx.compose.foundation.background
import androidx.compose.foundation.layout.Arrangement
import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.Row
import androidx.compose.foundation.layout.Spacer
import androidx.compose.foundation.layout.fillMaxSize
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.layout.size
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.foundation.lazy.items
import androidx.compose.material3.Card
import androidx.compose.material3.ExperimentalMaterial3Api
import androidx.compose.material3.MaterialTheme
import androidx.compose.material3.Text
import androidx.compose.runtime.Composable
import androidx.compose.ui.Alignment
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.res.painterResource
import androidx.compose.ui.text.font.FontWeight
import androidx.compose.ui.unit.dp
import androidx.navigation.NavController
import com.google.gson.Gson

@OptIn(ExperimentalMaterial3Api::class)
@Composable
fun MainScreen(
    navController: NavContrller
) {

    Column(modifier = Modifier.fillMaxSize()) {
        Row(
            modifier = Modifier
                .fillMaxWidth()
                .background(color = Color(0xFF081f5c))
                .padding(16.dp),
            verticalAlignment = Alignment.CenterVertically,
            horizontalArrangement = Arrangement.Center
        ) {
            Text(
                text = "Куди відправимось сьогодні? :)",
                color = MaterialTheme.colorScheme.onPrimary,
                style = MaterialTheme.typography.bodyLarge
            )
        }
        val landmarksList: List<ItemsData> = listOf(
            ItemsData(
                id = 1,
                title = "Києво-Печерська Лавра",
                description = "Святе місце",
                image = R.drawable.kyivlavra,
                detailDesc = "Свята Успенська Києво-Печерська Лавра є першим і найдавнішим монастирем на території сучасної України. Тільки три монастирські обителі мають в Україні в даний час статус лаври і освячені на честь Успіння Пресвятої Богородиці — Києво-Печерська, Почаївська і Святогірська. Це свідчить про особливе шанування Пресвятої Богородиці нашим православним народом, а також зв’язок монашества на Русі і древньої обителі Успіння Богоматері на Горі Афон.\n" +
                        "\n" +
                        "Заснований монастир в середині XI століття преподобними Антонієм і Феодосієм Печерськими. Зараз в печерах монастиря покояться нетлінні мощі понад 120 святих. Деякі з угодників Божих відомі всьому світу: преподобний Нестор Літописець, преподобний Ілля Муромець (його ратні подвиги описані в билинах, але це не вигаданий казковий персонаж, а реально існуючий богатир-воїн, який згодом прийняв чернечий постриг), преподобний Агапіт Печерський, лікар безкорисливий. По молитвам до всіх преподобних отців Києво-Печерських вже тисячоліття відбуваються чудеса і зцілення.\n" +
                        "\n" +
                        "Засновники колиски монашества на Русі — преподобні Антоній і Феодосій Печерські за Промислом Божим також спочивають своїми святими мощами в печерах, але під спудом, приховані, віриться, до часу, від очей людських. Всі угодники, що просяяли духовними подвигами в Києво-Печерській Лаврі, несуть в своїх молитвах і зараз перед Престолом Божим піклування про нас, хто до них зі своїми скорботами і негараздами в молитвах звертаються за допомогою.\n" +
                        "\n" +
                        "Територія Києво-Печерського монастиря займає понад двадцять гектарів. Він розташований в центрі столиці України — Києві, який ще з IX століття, як сказано в «Повісті минулих літ» (труд преподобного Києво-Печерського Нестора Літописця), іменується «матір’ю городам руським». Тут знаходиться більше ста споруд, в число яких входить безліч церков. У недільний день в Лаврі звершується до десяти Божественних Літургій. Але і в будні дні в різних храмах обителі постійно звершуються богослужіння. Шість древніх підземних храмів монастиря знаходяться в Дальніх і Ближніх печерах.\n" +
                        "\n" +
                        "На жаль, в даний час найдавніший з монастирів Русі розділений на дві частини — так звані Нижню і Верхню Лаври. У Нижній Лаврі, де знаходяться печери, розташовано нині діючий монастир, а Верхня її частина знаходиться у відомстві Міністерства культури України і являє собою Національний історико-культурний заповідник. Братія монастиря регулярно звершує богослужіння в Трапезному храмі Преподобних Антонія і Феодосія Печерських і головному храмі обителі — Успенському соборі.\n" +
                        "\n" +
                        "У стінах Києво-Печерської Лаври зараз працюють відроджена в 1989 році Київська духовна семінарія, а з 1992 року — Київська духовна академія, будівля якої раніше розташовувалася в одному з районів столиці — Подолі, де в даний час діє найвідоміший світський вищий навчальний заклад — Києво- Могилянська академія.\n" +
                        "\n" +
                        "Резиденція Предстоятеля Української Православної Церкви і Синодальні відділи знаходяться на території діючого Печерського монастиря, Блаженніший Митрополит Київський і всієї України є священноархімандритом Свято-Успенської Києво-Печерської Лаври. "//Todo Change this image
            ),
            ItemsData(
                id = 2,
                title = "Собор Святого Юра",
                description = "Святе місце",
                image = R.drawable.sobjur2,
                detailDesc = " Греко-католицький архикатедральний собор Святого Юра (площа Святого Юра, 5) – величний рококовий архітектурний ансамбль XVIII століття (до нього входять собор, дзвіниця, митрополичі палати і капітульні будівлі) домінує на високому узгір'ї над Львовом, чудово поєднуючись із міським ландшафтом.\n" +
                        "\n" +
                        "Пройшовши крізь браму, оздоблену алегоричними фігурами Римської та Грецької церков, ви потрапляєте на велике подвір’я храму. Зліва височить головний фасад катедри з могутнім порталом і фігурами святих Атанасія і Лева Шептицьких – архієреїв, котрим і завдячує своїм існуванням святиня. Аттик над порталом увінчаний скульптурною групою «Юрій Змієборець». Це геніальний твір митця Іоанна Пінзеля, найкращий зразок львівської скульптури XVIII століття, що стоїть в одному ряді з шедеврами світової пластики. \n" +
                        "\n" +
                        "У підземній частині собору – крипті – знаходяться саркофаги найвизначнішого діяча Греко-Католицької Церкви митрополита Андрея Шептицького та інших ієрархів.  \n" +
                        "\n" +
                        "Навпроти собору стоїть палац митрополитів, споруджений архітектором Фесінґером у XVIII столітті у стилі рококо з деякими вкрапленнями класицизму. Апартаменти палацу мають багате оздоблення. З іншого боку храму височіє дзвіниця, на якій висить найдавніший дзвін у всій Україні. Напис на ньому датований 1341 роком і свідчить про військові лихоліття давніх часів. Зі східної тераси подвір’я храму відкривається величний вигляд на місто.  " //Todo Change this image
            ),
            ItemsData(
                id = 3,
                title = "Асканія-Нова",
                description = "Природний заповідник",
                image = R.drawable.askanianova,
                detailDesc = "Біосферний заповідник “Асканія-Нова” імені Ф. Е. Фальц-Фейна розташований на півдні Херсонщини. Його створив у далекому 1898 році німецький барон Фрідріх Фальц-Фейн як приватну природоохоронну територію з екзотичними тваринами. Відтоді Асканія пережила багато трансформацій. У 1983 році заповідник отримав статус біосферного, а в 1984-му ввійшов до мережі біосферних резерватів ЮНЕСКО.\n" +
                        "\n" +
                        "Асканія-Нова – це справжня перлина української природи, яка вже давно набула всесвітньої слави. В Асканії поєдналися цілинний таврійський степ і мрія людини створити щось надзвичайне. Тут зростають унікальні рослини, гніздяться рідкісні птахи та живуть тварини з різних континентів.\n" +
                        "\n" +
                        "Територія заповідника розділена на 3 частини: Північну, Південну та Великий Чапельський під. Останній являє собою природну низовину та є абсолютно заповідною територією, де вільно пасуться тварини. У степу можна побачити сайгаків, бізонів, коней Пржевальського, антилоп та інших рідкісних тварин. У поді росте велика кількість червонокнижних рослин, серед них і ендемік Асканії-Нової – рябчик шаховий.\n" +
                        "\n" +
                        "В Асканії можна відвідати один з найкращих дендропарків України, який функціонує завдяки складній зрошувальній системі, а також зоопарк та орнітопарк.\n" +
                        "\n" +
                        "У заповіднику успішно розводять і селекціонують тварин. Так, в Асканії з’явилося кілька нових порід овець. Заповідник регулярно продає рідкісних тварин для колекцій зоопарків за кордоном.\n" +
                        "\n" +
                        "Біосферний заповідник “Асканія-Нова” – унікальне явище не тільки для України, а й для всього світу. Це найбільший степовий заповідник Європи, який щороку відвідує близько 140 тисяч туристів. "
            ),
            ItemsData(
                id = 4,
                title = "Резиденція митрополитів",
                description = "Історична споруда",
                image = R.drawable.rezidents,
                detailDesc = "Резиденція буковинських митрополитів була збудована у 1864-1882 роках за проектом видатного чеського архітектора Йозефа Главки. Він отримав замовлення від митрополита Євгена Гакмана, який бажав створити центр духовного і культурного життя Буковини.\n" +
                        "\n" +
                        "Після включення частини Буковини до складу Габсбурзької монархії у 1775 році була створена Буковинська єпархія з центром у місті Чернівці. Буковинські архієреї та консисторії швидко збудували “Єпископську резиденцію”. Місце під будівництво обрали на одному з місцевих пагорбів під назвою “Домнік” або “Панська гора”. З 1882 року пагорб отримав назву “Габсбурзька гора”, але в народі його називали “Гарбуз гора” через складнощі вимови.\n" +
                        "\n" +
                        "У 1849 році було утворено Герцогство Буковина. Єпископ Євгеній (Гакман) тоді не допустив приєднання місцевої православної церкви до Трансільванської митрополії. Натомість він використав свій вплив і авторитет для створення окремої митрополії.\n" +
                        "\n" +
                        "У лютому 1861 року владика Євгеній особисто передав відповідну петицію, ухвалену єпархіальними зборами, цісарю. Одночасно, він просив монарха санкціонувати будівництво нової православної архієрейської резиденції у Чернівцях, яка б відповідала статусу столиці коронного краю. Франц Йосиф I своїм указом від 20 серпня 1863 року затвердив план будівництва майбутнього архітектурного шедевру, пообіцявши в майбутньому прийняти позитивне рішення щодо питання Буковинської митрополії." +
                        "Резиденція православних митрополитів Буковини і Далмації служила не лише адміністративним центром, але й місцем духовного натхнення для багатьох поколінь. Вона стала символом православної віри та культурного обміну.\n" +
                        "\n" +
                        "Сьогодні резиденція є частиною Чернівецького національного університету імені Юрія Федьковича. Вона відкрита для відвідувачів як музей, де кожен може ознайомитися з її історією та культурним надбанням.\n" +
                        "\n" +
                        "Резиденція митрополитів Буковини і Далмації – це місце, що поєднує в собі духовність, історію та архітектурну велич. Вона є невід’ємною частиною культурного спадку України та заслуговує на увагу кожного, хто цікавиться історією та архітектурою. "
                ),
            ItemsData(
                id = 5,
                title = "Тустань",
                description = "Наскельний комплекс",
                image = R.drawable.tustan,
                detailDesc = "Якщо Вам набрид шум автомобілів, Ви втомились від міської метушні та хочете одночасно відпочити, щось дізнатися нового і провести день з користю, запрошуємо в цікаву мандрівку країною гір, річок  та мальовничих пейзажів. Так, Ви не помилились – це Карпати – дивовижний край, який надихав художників, поетів, композиторів на творчість.\n" +
                        "\n" +
                        "О краю мій, Підгір’я ти прекрасне,\n" +
                        "Як я люблю, як я люблю тебе!\n" +
                        "\n" +
                        "Так, з любов’ю про рідні Карпати писав Іван Франко, мандруючи горами, які чарували, зцілювали, надихали…  Ви теж митимете змогу побувати в тому місці, яке не раз відвідував Великий Каменяр - в скелястому заповіднику «Тустань», почути цікаві легенди та оповіді, які приховують уже впродовж віків кам’яні велетні. Саме в селі Урич, що на Сколівщина, знаходиться одне з семи чудес України, пам’ятка природи та археології - високі скелі - які здіймаються на висоту до 50 метрів. За свою багатовікову історію вони виконували роль і язичницького капища, і прикордонної фортеці, і митного пункту. Завдяки збереженим і дослідженим заглибинам в скелях, куди вставлялись дерев’яні конструкції, цю 5-ти поверхову фортецю, яка обороняла кордони Давньої Русі, можна відтворити на 90%.\n" +
                        "Ознайомившись з історією будівництва фортеці в місцевому музеї, Ви пройдетесь місцями бойової слави давньоруських захисників та підніметесь в дитинець цієї оборонної твердині, звідки відкриються чудові краєвиди карпатських гір. А при спуску з фортеці,  не забудьте зупинитись біля джерела зі срібною цілющою водою, якою лікував запалення очей Іван Франко. Дерев’яні споруди на великій галявині Вам розкажуть про проведення щорічного фестивалю середньовічної культури «ТуСтань»\n" +
                        "Отримавши море вражень та накупивши повно сувенірів на згадку (не забудьте про карпатський чай), повертаємось до автобуса. Та на цьому наша екскурсія не закінчується…\n" +
                        "А далі Вас чекає об’єкт Національного парку «Сколівські Бескиди» красивий 7-ми метровий водоспад на річці Кам’янка, яка, протікає у мальовничій каньйоноподібній долині з урвистими скелястими берегами. Водоспад утворився в проломі гірського хребта і вода спадає з висоти великих скель. Якщо ж у Вас є сили трішки піднятися вгору, то матимете змогу олянути Мертве озеро Карпат - озеро-болото “Журавлине” та почути містичні історії про нього. А якщо Ви втомились, рекомендуємо набратися сил з джерела «Жива вода», яка за своїм сірководневим складом подібна на трускавецьку «Нафтусю».\n" +
                        "Отож, після нашої екскурсії, ви  захочете повертатися  сюди  знову і знову та милуватися  природою карпатських гір,  дихати  неймовірно чистим повітрям і смакувати кришталево чисту воду з джерел цього неймовірного краю який зветься Карпатами.     "
            )
        )
        LazyColumn(
            content = {
                items(landmarksList) { item ->
                    Card(
                        onClick = {
                            val itemJson = Gson().toJson(item)
                            navController.navigate(Screen.DetailScreen.createRoute(itemJson))
                        }, modifier = Modifier
                            .fillMaxWidth()
                            .size(width = 200.dp, height = 100.dp)
                            .padding(8.dp)
                    ) {
                        Row(
                            modifier = Modifier
                                .fillMaxWidth()
                                .background(color = Color(0xFFBAD6EB)),
                            verticalAlignment = Alignment.CenterVertically,
                            horizontalArrangement = Arrangement.SpaceBetween
                        ) {
                            Column(
                                modifier = Modifier
                                    .padding(8.dp),
                                verticalArrangement = Arrangement.Center,
                                horizontalAlignment = Alignment.Start
                            ) {
                                Text(
                                    text = item.title,
                                    style = MaterialTheme.typography.bodyMedium,
                                    fontWeight = FontWeight.Black
                                )
                                Spacer(modifier = Modifier.padding(4.dp))
                                Text(
                                    text = item.description,
                                    style = MaterialTheme.typography.bodySmall,
                                    fontWeight = FontWeight.Black
                                )
                            }
                            Image(
                                painter = painterResource(id = item.image),
                                contentDescription = "Landmark Image"
                            )
                        }
                    }
                }
            }, modifier = Modifier
                .padding(vertical = 8.dp)
                .fillMaxSize()

        )

    }

}